blog/2016/03/18/firewall-iptables/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>防火墙！防火墙！ - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="iptables的防火墙配置" />
  <meta name="keywords" content="iptables, firewall, linux, tcp" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>防火墙！防火墙！</h1>
            <p>
长话短说，发现了一堆扫描和嗅探，所以需要一定的防御。
</p>

<p>
机器同时有两个网卡，分别属于内网和外网。
</p>

<p>
攻击都是来自于外网，所以希望能够关闭外网的入网访问，但是保留对于外网的访问权限。
</p>

<div id="outline-container-orgfa97cdc" class="outline-2">
<h2 id="orgfa97cdc">目标</h2>
<div class="outline-text-2" id="text-orgfa97cdc">
<ol class="org-ol">
<li>关闭大部分机器的外网入网流量</li>
<li>跳板机仅开放ssh访问</li>
<li>对于开放外网访问的跳板机，保留公司网络访问的能力, 用于远程调试，数据库连接</li>
<li>内网间的访问不受影响</li>
<li>不响应ping请求，提高扫描的门槛</li>
</ol>
</div>
</div>

<div id="outline-container-org42d8581" class="outline-2">
<h2 id="org42d8581">方案</h2>
<div class="outline-text-2" id="text-org42d8581">
<p>
前段时间玩了会 <a href="https://github.com/RMerl/asuswrt-merlin"><code>merlin固件</code></a>, 使用的是<a href="https://github.com/koolshare">国内修饰过的版本</a>， 加了一些 `安全上网`, `离线下载`等功能。看了一下里面对于路由规则的实现，基本都是基于 `iptables` 来完成。比如内网转外网，阻止外网请求，对指定网卡开放指定端口。对于指定ip的请求走不同的端口等。
</p>

<p>
目标其实也很类似，就用 `iptables` 来尝试完成好了。
</p>
</div>
</div>

<div id="outline-container-org4ee844e" class="outline-2">
<h2 id="org4ee844e">实施</h2>
<div class="outline-text-2" id="text-org4ee844e">
</div>
<div id="outline-container-org326cad4" class="outline-3">
<h3 id="org326cad4">简介</h3>
<div class="outline-text-3" id="text-org326cad4">
<p>
由于只是配置防火墙，了解下面的简单用法就基本足够了。
</p>

<p>
PS: iptables的规则先后顺序很重要!
</p>

<dl class="org-dl">
<dt>iptables -F</dt><dd>清除自定义规则</dd>
<dt>iptables -A &lt;filter&gt; [match rules] -j &lt;target&gt;</dt><dd>在指定filter上添加规则</dd>
<dt>iptables -D &lt;filter&gt; [match rules] -j &lt;target&gt;</dt><dd>在指定filter上删除规则</dd>
</dl>
</div>

<div id="outline-container-orga36ca22" class="outline-4">
<h4 id="orga36ca22">匹配的规则</h4>
<div class="outline-text-4" id="text-orga36ca22">
<dl class="org-dl">
<dt>-i &lt;eth0&gt;</dt><dd>指定网卡</dd>
<dt>-s &lt;ip&gt;</dt><dd>指定来源ip</dd>
<dt>-dport &lt;port&gt;</dt><dd>指定目标端口</dd>
</dl>
</div>
</div>
</div>


<div id="outline-container-org25675d5" class="outline-3">
<h3 id="org25675d5">仅阻止外网的流入请求</h3>
<div class="outline-text-3" id="text-org25675d5">
<ul class="org-ul">
<li><p>
不接受外网的tcp握手请求
</p>

<p>
这里不能拒绝所有的tcp流量，否则机器也访问不了外部网络。（所有流入的tcp流量都被丢弃了）
</p></li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">iptables -A INPUT -i &lt;eth&gt; -p tcp --syn -j DROP
</pre>
</div>

<ul class="org-ul">
<li>不接受所有进入的udp流量</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">iptables -A INPUT -i &lt;eth&gt; -p udp -j DROP
</pre>
</div>
</div>
</div>

<div id="outline-container-org547ebc3" class="outline-3">
<h3 id="org547ebc3">保留跳板机ssh的端口</h3>
<div class="outline-text-3" id="text-org547ebc3">
<div class="org-src-container">
<pre class="src src-sh">iptables -A INPUT -i &lt;eth&gt; -p tcp -m multiport --dports ssh -j ACCEPT
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbf63f1" class="outline-3">
<h3 id="orgbbf63f1">不响应ping</h3>
<div class="outline-text-3" id="text-orgbbf63f1">
<div class="org-src-container">
<pre class="src src-sh">iptables -A INPUT -i &lt;eth&gt; -p icmp --icmp-type echo-request -j DROP
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c48133" class="outline-3">
<h3 id="org2c48133">允许指定&lt;ip&gt;的tcp流量</h3>
<div class="outline-text-3" id="text-org2c48133">
<div class="org-src-container">
<pre class="src src-sh">iptables -A INPUT -i &lt;eth&gt; -p tcp -s &lt;ip&gt; -j ACCEPT
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga6674fe" class="outline-2">
<h2 id="orga6674fe">最终脚本</h2>
<div class="outline-text-2" id="text-orga6674fe">
</div>
<div id="outline-container-org20fca64" class="outline-3">
<h3 id="org20fca64">跳板机器</h3>
<div class="outline-text-3" id="text-org20fca64">
<div class="org-src-container">
<pre class="src src-sh">iptables -A INPUT -i &lt;eth&gt; -p tcp -m multiport --dports ssh -j ACCEPT
iptables -A INPUT -i &lt;eth&gt; -p tcp -s &lt;ip&gt; -j ACCEPT
iptables -A INPUT -i &lt;eth&gt; -p tcp --syn -j DROP
iptables -A INPUT -i &lt;eth&gt; -p udp -j DROP
iptables -A INPUT -i &lt;eth&gt; -p icmp --icmp-type echo-request -j DROP
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0a58f6" class="outline-3">
<h3 id="orgb0a58f6">内部机器</h3>
<div class="outline-text-3" id="text-orgb0a58f6">
<div class="org-src-container">
<pre class="src src-sh">iptables -A INPUT -i &lt;eth&gt; -p tcp --syn -j DROP
iptables -A INPUT -i &lt;eth&gt; -p udp -j DROP
iptables -A INPUT -i &lt;eth&gt; -p icmp --icmp-type echo-request -j DROP
</pre>
</div>
</div>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2016-03-18</span>
        <span title="last modification date" class="post-info">2016-03-18</span>
        <span title="tags" class="post-info"><a href="/tags/linux/">linux</a>, <a href="/tags/firewall/">firewall</a>, <a href="/tags/iptables/">iptables</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
